{
  "intro": {
    "name": "Dustin Dinsmore",
    "nickname": "Excelling in Service, One Guest at a Time",
    "phone": "(626) 222-3107",
    "email": "ddinsmore8@gmail.com",
    "github": "",
    "linkedin": "",
    "location": "1011 23rd Street, San Diego, CA 92102",
    "website": "",
    "availability": "All Night Shifts"
  },
  "projects": [
    {
      "name": "FLI Golf",
      "details": "Co-founded disc golf league focused on fan experience, elevating player status and viewership, and showcasing partner brands via custom course designs. Team: Andrew Panza (CEO), Dustin Dinsmore (CTO), Corey La Russo (CMO), Alexander Smart (CFO); leveraging market analysis, networks, and partnerships (not competing) to grow the sport and capture market share.",
      "url": "linkedin.com/company/fligolf",
      "hide": false
    }
  ],
  "technologies": [
    {
      "section": "Objective:",
      "details": "Experienced bartender and manager with 14+ years in high‑volume, guest‑focused venues. Seeking an evening bartender role (Thu–Sun) to deliver exceptional service, drive sales, and keep bar operations running smoothly."
    },
    {
      "section": "Skills:",
      "details": "Inventory management; Exceptional customer service; Excellent communication; Ability to work under pressure"
    },
    {
      "section": "Summary:",
      "details": "Proactive and reliable hospitality professional with a strong track record in bartending and management. Known for adaptability, teamwork, and maintaining composure under pressure to create outstanding guest experiences."
    },
    {
      "section": "Desired Schedule:",
      "details": "Thursday–Sunday: Evening; Monday–Wednesday: Call"
    }
  ],
  "workExperiences": [
    {
      "position": "Bartender",
      "company": "Red Tracton’s, Solana Beach",
      "url": "",
      "years": [
        "2012",
        "Present"
      ],
      "details": [
        "Oversee all bar operations and deliver high-quality customer service",
        "Maintain inventory control and handle restocking duties",
        "Prepare and serve a variety of cocktails following standard recipes",
        "Organize and manage bar supplies and equipment for efficiency",
        "Document and report any unusual occurrences or issues to management",
        "Excel in high-pressure, high-volume service during peak hours",
        "Collaborate with team members to ensure smooth operations and guest satisfaction"
      ]
    },
    {
      "position": "Bartender",
      "company": "The Cardiff Office, Cardiff",
      "url": "",
      "years": [
        "2010",
        "2012"
      ],
      "details": [
        "Managed all aspects of bar operations, delivering exceptional customer experiences",
        "Maintained a clean, organized, and welcoming bar environment",
        "Prepared a wide range of cocktails and beverages to customer specifications",
        "Developed rapport with regular customers, contributing to repeat business"
      ]
    },
    {
      "position": "Manager / Bartender / Server",
      "company": "The Flying Bridge, Oceanside",
      "url": "",
      "years": [
        "2009",
        "2012"
      ],
      "details": [
        "Promoted to Manager within three months due to strong performance and leadership",
        "Managed scheduling, hiring, inventory control, and ordering",
        "Oversaw daily operations to ensure efficient workflow and high-quality service",
        "Fostered effective communication between staff and ownership",
        "Maintained high standards for team accountability and side work completion",
        "Provided bar and floor service, engaging customers and ensuring satisfaction"
      ]
    }
  ],
  "educations": [
    {
      "head": "Arcadia High School",
      "details": "Graduate, 1989"
    }
  ],
  "interests": [
    "Golf",
    "Disc Golf",
    "Writing code and programming"
  ],
  "documents": [
    {
      "name": "Sexual Harassment Certificate",
      "url": "/sh_1.png",
      "hide": false
    },
    {
      "name": "ABC LEAD Certificate",
      "url": "/ABC-Server-Training.pdf",
      "hide": false
    },
    {
      "name": "Food Handler Certificate",
      "url": "/GetCert.pdf",
      "hide": false
    }
  ],
  "media": [
    {
      "name": "In Action",
      "url": "/images/dd_pic.MOV",
      "type": "video/quicktime",
      "hide": true
    }
  ],
  "resumeUrl": {
    "sourceLink": "https://github.com/HalftimeHarry/resume",
    "fullVersionLink": ""
  }
}